# -*- coding:utf-8 -*-
f = open("E:\付林虎\付林虎\python\day1\python\io1\source","r",encoding="utf-8")

str0 = ''
for i in f:
    str0+=i.strip('\n')

print(str0)


str1 = "万平方米销售||地块||金额||出让||房地产||地产||房企||平方米||建筑面积||用地||物业||住宅||面积||城市||销售额||土地||成交||置业||市场||中国||环比||住房||恒大||碧桂园||二手房||新城||万科||利率||融创||融资||溢价||净利润||绿地||业主||楼面||购房||价约||租赁||中海||容积率||绿城||转让||租金||房价||成交量||底价||房源||区域||小区||上市||世茂||商品房||每平方米||宅地||新房||回迁房||首开||研究院||佳兆业||贝壳||龙湖||土地储备||居住用地||挂牌||旭辉||认购||金茂||奥园||债务||预售||期限||万达||上涨||交易||竞价||富力||限价||荣盛||龙光||国际||购房者||发售||正荣||找房||增速||泰禾||公寓||房产||粤港澳||金科||公积金||百分点||全国||建筑||货值||华润||运营||限购||回售||回购||改造||宗地||商品住宅||联合体||负债||短期||涨幅||调控||楼市||租客||总价||禹洲||首创||配售||华夏||弘阳||合营||合生||广场||增加||网签||平台||中南||商住||竞房||宝龙||租房||房住||城投||营收||违规||投资者||售楼处||融信||家房||华发||易居||千亿||年利率||毛利率||楼盘||境外||交付||监管||回款||供应||福晟||代建||报价||下跌||入市||配建||金融||缴纳||地价||安居||银行||溢利||套房||商户||联席||利润||竞买||金地||港交所||房屋||创展||中骏||越秀||远洋||亿平方米||延期||写字楼||退房||土储||年期||经营||经济||价款||房子||二手||成交价||不动产||滨江||增长||雅居乐||收窄||商服||片区||联营合营||客户||街道||公司||蛋壳||产权||周期||医院||业绩||下调||赎回||商务||居住||建业||挂出||房贷||补贴||别墅||资产负债率||央行||新交所||新华联||销售每平方米||使用权||商管||全球||开业||竣工||降幅||建委||建局||家庭||集团||海外||城区||成交额||并购||租户||自如||资本||住房面积||增值||园区||营销||养老||铁建||首付||实业||施工||上交所||买房||居民||金辉||结转||降息||豪宅||股价||非住宅||出让金||支付||债权||用房||小镇||小房||收益||上升||商业地产||热度||配套||拍卖||敏捷||毛利||链家||联交所||利息||看房||金隅||缴存||交房||佳源||购房人||风险||丰台区||分拆||跌幅||出租||自然资源||资管||转换||中粮||摇号||新区||下半年||委任||违法||孙宏斌||售楼||商品||起价||普宅||卖方||楼宇||康养||降准||回落||负债率"

print(str1[0:1024])